public class TestDemo01 {
    public static void main(String[] args) {
        {
            /**公鸡 = 1块，母鸡= 3块 ，小鸡 = 0.5块
             * 公鸡10母鸡18小鸡72
             * ==========
             * 公鸡25母鸡15小鸡60
             * ==========
             * 公鸡40母鸡12小鸡48
             * ==========
             * 公鸡55母鸡9小鸡36
             * ==========
             * 公鸡70母鸡6小鸡24
             * ==========
             * 公鸡85母鸡3小鸡12
             * ==========
             * 公鸡100母鸡0小鸡0
             */
            for (int x = 0; x <= 100; x++) {
                for (int y = 0; y <= 33; y++) {
                    for (int z = 0; z <= 200; z += 3) {
                        if (x  + y * 3 + z * 0.5 == 100 && x + y + z == 100) {
                            System.out.println("==========");
                            System.out.println("公鸡" + x+"母鸡" + y+"小鸡" + z);
                        }
                    }
                }
            }
        }
    }
}


